ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/CANFD1_1.0.xml
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EFBI" description="Edge Filtering during Bus Integration
  0  Edge filtering disabled
  1  Two consecutive dominant tq required to detect an edge for hard synchronization
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TXP" description="Transmit Pause. If this bit is set, the MCAN pauses for two CAN bit times before starting the next transmission after itself has successfully transmitted a frame.
  0  Transmit pause disabled
  1  Transmit pause enabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="NISO" description="Non ISO Operation. If this bit is set, the MCAN uses the CAN FD frame format as specified by the Bosch CAN FD Specification V1.0.
  0  CAN FD frame format according to ISO 11898-1:2015
  1  CAN FD frame format according to Bosch CAN FD Specification V1.0" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_NBTP" width="32" offset="0x1C" description="MCAN Nominal Bit Timing and Prescaler Register">
            <bitfield id="NTSEG2" description="Nominal Time Segment After Sample Point. Valid values are 1 to 127. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="NTSEG1" description="Nominal Time Segment Before Sample Point. Valid values are 1 to 255. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="15" end="8" width="8" rwaccess="R/W">
            </bitfield>
            <bitfield id="NBRP" description="Nominal Bit Rate Prescaler. The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Bit Rate Prescaler are 0 to 511. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="24" end="16" width="9" rwaccess="R/W">
            </bitfield>
            <bitfield id="NSJW" description="Nominal (Re)Synchronization Jump Width. Valid values are 0 to 127. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="31" end="25" width="7" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TSCC" width="32" offset="0x20" description="MCAN Timestamp Counter Configuration">
            <bitfield id="TSS" description="Timestamp Select
  00  Timestamp counter value always 0x0000
  01  Timestamp counter value incremented according to TCP
  10  External timestamp counter value used
  11  Same as &amp;quot;00&amp;quot;
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="1" end="0" width="2" rwaccess="R/W">
            </bitfield>
            <bitfield id="TCP" description="Timestamp Counter Prescaler. Configures the timestamp and timeout counters time unit in multiples of CAN bit times. Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Note: With CAN FD an external counter is required for timestamp generation (TSS = &amp;quot;10&amp;quot;).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="19" end="16" width="4" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TSCV" width="32" offset="0x24" description="MCAN Timestamp Counter Value">
            <bitfield id="TSC" description="Timestamp Counter. The internal/external Timestamp Counter value is captured on start of frame (both Rx and Tx). When TSCC.TSS = &amp;quot;01&amp;quot;, the Timestamp Counter is incremented in multiples of CAN bit times, (1...16), depending on the configuration of TSCC.TCP. A wrap around sets interrupt flag IR.TSW. Write access resets the counter to zero. When TSCC.TSS = &amp;quot;10&amp;quot;, TSC reflects the External Timestamp Counter value, and a write access has no impact.
 
Note: A &amp;quot;wrap around&amp;quot; is a change of the Timestamp Counter value from non-zero to zero not
caused by write access to MCAN_TSCV." begin="15" end="0" width="16" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TOCC" width="32" offset="0x28" description="MCAN Timeout Counter Configuration">
            <bitfield id="ETOC" description="Enable Timeout Counter
  0  Timeout Counter disabled
  1  Timeout Counter enabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TOS" description="Timeout Select. When operating in Continuous mode, a write to TOCV presets the counter to the value configured by TOCC.TOP and continues down-counting. When the Timeout Counter is controlled by one of the FIFOs, an empty FIFO presets the counter to the value configured by TOCC.TOP. Down-counting is started when the first FIFO element is stored.
  00  Continuous operation
  01  Timeout controlled by Tx Event FIFO
  10  Timeout controlled by Rx FIFO 0
  11  Timeout controlled by Rx FIFO 1
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="2" end="1" width="2" rwaccess="R/W">
            </bitfield>
            <bitfield id="TOP" description="Timeout Period. Start value of the Timeout Counter (down-counter). Configures the Timeout Period.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="31" end="16" width="16" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TOCV" width="32" offset="0x2C" description="MCAN Timeout Counter Value">
            <bitfield id="TOC" description="Timeout Counter. The Timeout Counter is decremented in multiples of CAN bit times, (1...16), depending on the configuration of TSCC.TCP. When decremented to zero, interrupt flag IR.TOO is set and the Timeout Counter is stopped. Start and reset/restart conditions are configured via TOCC.TOS." begin="15" end="0" width="16" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_ECR" width="32" offset="0x40" description="MCAN Error Counter Register">
            <bitfield id="TEC" description="Transmit Error Counter. Actual state of the Transmit Error Counter, values between 0 and 255.
 
Note: When CCCR.ASM is set, the CAN protocol controller does not increment TEC and REC when a CAN protocol error is detected, but CEL is still incremented." begin="7" end="0" width="8" rwaccess="R">
            </bitfield>
            <bitfield id="REC" description="Receive Error Counter. Actual state of the Receive Error Counter, values between 0 and 127.
 
Note: When CCCR.ASM is set, the CAN protocol controller does not increment TEC and REC when a CAN protocol error is detected, but CEL is still incremented." begin="14" end="8" width="7" rwaccess="R">
            </bitfield>
            <bitfield id="RP" description="Receive Error Passive
  0  The Receive Error Counter is below the error passive level of 128
  1  The Receive Error Counter has reached the error passive level of 128" begin="15" end="15" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CEL" description="CAN Error Logging. The counter is incremented each time when a CAN protocol error causes the Transmit Error Counter or the Receive Error Counter to be incremented. It is reset by read access to CEL. The counter stops at 0xFF; the next increment of TEC or REC sets interrupt flag IR.ELO.
 
