ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/CANFD1_1.0.xml
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="6" end="0" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="TDCO" description="Transmitter Delay Compensation Offset. Offset value defining the distance between the measured delay from the internal CAN TX signal to the internal CAN RX signal and the secondary sample point. Valid values are 0 to 127 mtq.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="14" end="8" width="7" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_IR" width="32" offset="0x50" description="MCAN Interrupt Register">
            <bitfield id="RF0N" description="Rx FIFO 0 New Message
  0  No new message written to Rx FIFO 0
  1  New message written to Rx FIFO 0" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0W" description="Rx FIFO 0 Watermark Reached
  0  Rx FIFO 0 fill level below watermark
  1  Rx FIFO 0 fill level reached watermark" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0F" description="Rx FIFO 0 Full
  0  Rx FIFO 0 not full
  1  Rx FIFO 0 full" begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0L" description="Rx FIFO 0 Message Lost
  0  No Rx FIFO 0 message lost
  1  Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero" begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1N" description="Rx FIFO 1 New Message
  0  No new message written to Rx FIFO 1
  1  New message written to Rx FIFO 1" begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1W" description="Rx FIFO 1 Watermark Reached
  0  Rx FIFO 1 fill level below watermark
  1  Rx FIFO 1 fill level reached watermark" begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1F" description="Rx FIFO 1 Full
  0  Rx FIFO 1 not full
  1  Rx FIFO 1 full" begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1L" description="Rx FIFO 1 Message Lost
  0  No Rx FIFO 1 message lost
  1  Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero" begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="HPM" description="High Priority Message
  0  No high priority message received
  1  High priority message received" begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TC" description="Transmission Completed
  0  No transmission completed
  1  Transmission completed" begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TCF" description="Transmission Cancellation Finished
  0  No transmission cancellation finished
  1  Transmission cancellation finished" begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TFE" description="Tx FIFO Empty
  0  Tx FIFO non-empty
  1  Tx FIFO empty" begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFN" description="Tx Event FIFO New Entry
  0  Tx Event FIFO unchanged
  1  Tx Handler wrote Tx Event FIFO element" begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFW" description="Tx Event FIFO Watermark Reached
  0  Tx Event FIFO fill level below watermark
  1  Tx Event FIFO fill level reached watermark" begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFF" description="Tx Event FIFO Full
  0  Tx Event FIFO not full
  1  Tx Event FIFO full" begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFL" description="Tx Event FIFO Element Lost
  0  No Tx Event FIFO element lost
  1  Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TSW" description="Timestamp Wraparound
  0  No timestamp counter wrap-around
  1  Timestamp counter wrapped around" begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="MRAF" description="Message RAM Access Failure.  The flag is set, when the Rx Handler:
  - has not completed acceptance filtering or storage of an accepted message until the arbitration field of the following message has been received. In this case acceptance filtering or message storage is aborted and the Rx Handler starts processing of the following message.
  - was not able to write a message to the Message RAM. In this case message storage is aborted.
 
In both cases the FIFO put index is not updated resp. the New Data flag for a dedicated Rx Buffer is not set, a partly stored message is overwritten when the next message is stored to this location.
 
The flag is also set when the Tx Handler was not able to read a message from the Message RAM in time. In this case message transmission is aborted. In case of a Tx Handler access failure the MCAN is switched into Restricted Operation Mode. To leave Restricted Operation Mode, the Host CPU has to reset CCCR.ASM.
  0  No Message RAM access failure occurred
  1  Message RAM access failure occurred" begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TOO" description="Timeout Occurred
  0  No timeout
  1  Timeout reached" begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="DRX" description="Message Stored to Dedicated Rx Buffer. The flag is set whenever a received message has been stored into a dedicated Rx Buffer.
  0  No Rx Buffer updated
  1  At least one received message stored into an Rx Buffer" begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BEU" description="Bit Error Uncorrected. Message RAM bit error detected, uncorrected. This bit is set when a double bit error is detected by the ECC aggregator attached to the Message RAM. An uncorrected Message RAM bit error sets CCCR.INIT to '1'. This is done to avoid transmission of corrupted data.
  0  No bit error detected when reading from Message RAM
  1  Bit error detected, uncorrected (e.g. parity logic)" begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ELO" description="Error Logging Overflow
  0  CAN Error Logging Counter did not overflow
  1  Overflow of CAN Error Logging Counter occurred" begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EP" description="Error Passive
  0  Error_Passive status unchanged
  1  Error_Passive status changed" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EW" description="Warning Status
  0  Error_Warning status unchanged
  1  Error_Warning status changed" begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BO" description="Bus_Off Status
  0  Bus_Off status unchanged
  1  Bus_Off status changed" begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="WDI" description="Watchdog Interrupt
  0  No Message RAM Watchdog event occurred
  1  Message RAM Watchdog event due to missing READY" begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="PEA" description="Protocol Error in Arbitration Phase (Nominal Bit Time is used)
  0  No protocol error in arbitration phase
  1  Protocol error in arbitration phase detected (PSR.LEC ? 0,7)" begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="PED" description="Protocol Error in Data Phase (Data Bit Time is used)
  0  No protocol error in data phase
  1  Protocol error in data phase detected (PSR.DLEC ? 0,7)" begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ARA" description="Access to Reserved Address
  0  No access to reserved address occurred
  1  Access to reserved address occurred" begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
        </register>
