ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/CANFD1_1.0.xml
Each Tx Buffer has its own Add Request bit. Writing a '1' will set the corresponding Add Request bit; writing a '0' has no impact. This enables the Host to set transmission requests for multiple Tx Buffers with one write to TXBAR. TXBAR bits are set only for those Tx Buffers configured via TXBC. When no Tx scan is running, the bits are reset immediately, else the bits remain set until the Tx scan process has completed.
  0  No transmission request added
  1  Transmission requested added
 
Note: If an add request is applied for a Tx Buffer with pending transmission request (corresponding TXBRP bit already set), this add request is ignored.
 
Qualified Write is possible only with CCCR.CCE='0'" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR1" description="Add Request 1. See description for bit 0." begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR2" description="Add Request 2. See description for bit 0." begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR3" description="Add Request 3. See description for bit 0." begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR4" description="Add Request 4. See description for bit 0." begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR5" description="Add Request 5. See description for bit 0." begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR6" description="Add Request 6. See description for bit 0." begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR7" description="Add Request 7. See description for bit 0." begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR8" description="Add Request 8. See description for bit 0." begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR9" description="Add Request 9. See description for bit 0." begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR10" description="Add Request 10. See description for bit 0." begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR11" description="Add Request 11. See description for bit 0." begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR12" description="Add Request 12. See description for bit 0." begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR13" description="Add Request 13. See description for bit 0." begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR14" description="Add Request 14. See description for bit 0." begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR15" description="Add Request 15. See description for bit 0." begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR16" description="Add Request 16. See description for bit 0." begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR17" description="Add Request 17. See description for bit 0." begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR18" description="Add Request 18. See description for bit 0." begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR19" description="Add Request 19. See description for bit 0." begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR20" description="Add Request 20. See description for bit 0." begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR21" description="Add Request 21. See description for bit 0." begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR22" description="Add Request 22. See description for bit 0." begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR23" description="Add Request 23. See description for bit 0." begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR24" description="Add Request 24. See description for bit 0." begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR25" description="Add Request 25. See description for bit 0." begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR26" description="Add Request 26. See description for bit 0." begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR27" description="Add Request 27. See description for bit 0." begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR28" description="Add Request 28. See description for bit 0." begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR29" description="Add Request 29. See description for bit 0." begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR30" description="Add Request 30. See description for bit 0." begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="AR31" description="Add Request 31. See description for bit 0." begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TXBCR" width="32" offset="0xD4" description="MCAN Tx Buffer Cancellation Request">
            <bitfield id="CR0" description="Cancellation Request 0.
 
Each Tx Buffer has its own Cancellation Request bit. Writing a '1' will set the corresponding Cancellation Request bit; writing a '0' has no impact. This enables the Host to set cancellation requests for multiple Tx Buffers with one write to TXBCR. TXBCR bits are set only for those Tx Buffers configured via TXBC. The bits remain set until the corresponding bit of TXBRP is reset.
  0  No cancellation pending
  1  Cancellation pending
 
Qualified Write is possible only with CCCR.CCE='0'" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR1" description="Cancellation Request 1. See description for bit 0." begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR2" description="Cancellation Request 2. See description for bit 0." begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR3" description="Cancellation Request 3. See description for bit 0." begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR4" description="Cancellation Request 4. See description for bit 0." begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR5" description="Cancellation Request 5. See description for bit 0." begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR6" description="Cancellation Request 6. See description for bit 0." begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR7" description="Cancellation Request 7. See description for bit 0." begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR8" description="Cancellation Request 8. See description for bit 0." begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR9" description="Cancellation Request 9. See description for bit 0." begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR10" description="Cancellation Request 10. See description for bit 0." begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR11" description="Cancellation Request 11. See description for bit 0." begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR12" description="Cancellation Request 12. See description for bit 0." begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR13" description="Cancellation Request 13. See description for bit 0." begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR14" description="Cancellation Request 14. See description for bit 0." begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR15" description="Cancellation Request 15. See description for bit 0." begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR16" description="Cancellation Request 16. See description for bit 0." begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR17" description="Cancellation Request 17. See description for bit 0." begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR18" description="Cancellation Request 18. See description for bit 0." begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR19" description="Cancellation Request 19. See description for bit 0." begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR20" description="Cancellation Request 20. See description for bit 0." begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR21" description="Cancellation Request 21. See description for bit 0." begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR22" description="Cancellation Request 22. See description for bit 0." begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR23" description="Cancellation Request 23. See description for bit 0." begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR24" description="Cancellation Request 24. See description for bit 0." begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR25" description="Cancellation Request 25. See description for bit 0." begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR26" description="Cancellation Request 26. See description for bit 0." begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR27" description="Cancellation Request 27. See description for bit 0." begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR28" description="Cancellation Request 28. See description for bit 0." begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR29" description="Cancellation Request 29. See description for bit 0." begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR30" description="Cancellation Request 30. See description for bit 0." begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CR31" description="Cancellation Request 31. See description for bit 0." begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TXBTO" width="32" offset="0xD8" description="MCAN Tx Buffer Transmission Occurred">
            <bitfield id="TO0" description="Transmission Occurred 0.
 
Each Tx Buffer has its own Transmission Occurred bit. The bits are set when the corresponding TXBRP bit is cleared after a successful transmission. The bits are reset when a new transmission is requested by writing a '1' to the corresponding bit of register TXBAR.
  0  No transmission occurred
  1  Transmission occurred" begin="0" end="0" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO1" description="Transmission Occurred 1. See description for bit 0." begin="1" end="1" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO2" description="Transmission Occurred 2. See description for bit 0." begin="2" end="2" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO3" description="Transmission Occurred 3. See description for bit 0." begin="3" end="3" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO4" description="Transmission Occurred 4. See description for bit 0." begin="4" end="4" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO5" description="Transmission Occurred 5. See description for bit 0." begin="5" end="5" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO6" description="Transmission Occurred 6. See description for bit 0." begin="6" end="6" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO7" description="Transmission Occurred 7. See description for bit 0." begin="7" end="7" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO8" description="Transmission Occurred 8. See description for bit 0." begin="8" end="8" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO9" description="Transmission Occurred 9. See description for bit 0." begin="9" end="9" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO10" description="Transmission Occurred 10. See description for bit 0." begin="10" end="10" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO11" description="Transmission Occurred 11. See description for bit 0." begin="11" end="11" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO12" description="Transmission Occurred 12. See description for bit 0." begin="12" end="12" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO13" description="Transmission Occurred 13. See description for bit 0." begin="13" end="13" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO14" description="Transmission Occurred 14. See description for bit 0." begin="14" end="14" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO15" description="Transmission Occurred 15. See description for bit 0." begin="15" end="15" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO16" description="Transmission Occurred 16. See description for bit 0." begin="16" end="16" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO17" description="Transmission Occurred 17. See description for bit 0." begin="17" end="17" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO18" description="Transmission Occurred 18. See description for bit 0." begin="18" end="18" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO19" description="Transmission Occurred 19. See description for bit 0." begin="19" end="19" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO20" description="Transmission Occurred 20. See description for bit 0." begin="20" end="20" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO21" description="Transmission Occurred 21. See description for bit 0." begin="21" end="21" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO22" description="Transmission Occurred 22. See description for bit 0." begin="22" end="22" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO23" description="Transmission Occurred 23. See description for bit 0." begin="23" end="23" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO24" description="Transmission Occurred 24. See description for bit 0." begin="24" end="24" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO25" description="Transmission Occurred 25. See description for bit 0." begin="25" end="25" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO26" description="Transmission Occurred 26. See description for bit 0." begin="26" end="26" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO27" description="Transmission Occurred 27. See description for bit 0." begin="27" end="27" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO28" description="Transmission Occurred 28. See description for bit 0." begin="28" end="28" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO29" description="Transmission Occurred 29. See description for bit 0." begin="29" end="29" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO30" description="Transmission Occurred 30. See description for bit 0." begin="30" end="30" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TO31" description="Transmission Occurred 31. See description for bit 0." begin="31" end="31" width="1" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TXBCF" width="32" offset="0xDC" description="MCAN Tx Buffer Cancellation Finished">
            <bitfield id="CF0" description="Cancellation Finished 0.
 
Each Tx Buffer has its own Cancellation Finished bit. The bits are set when the corresponding TXBRP bit is cleared after a cancellation was requested via TXBCR. In case the corresponding TXBRP bit was not set at the point of cancellation, CF is set immediately. The bits are reset when a new transmission is requested by writing a '1' to the corresponding bit of register TXBAR.
  0  No transmit buffer cancellation
  1  Transmit buffer cancellation finished" begin="0" end="0" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF1" description="Cancellation Finished 1. See description for bit 0." begin="1" end="1" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF2" description="Cancellation Finished 2. See description for bit 0." begin="2" end="2" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF3" description="Cancellation Finished 3. See description for bit 0." begin="3" end="3" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF4" description="Cancellation Finished 4. See description for bit 0." begin="4" end="4" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF5" description="Cancellation Finished 5. See description for bit 0." begin="5" end="5" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF6" description="Cancellation Finished 6. See description for bit 0." begin="6" end="6" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF7" description="Cancellation Finished 7. See description for bit 0." begin="7" end="7" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF8" description="Cancellation Finished 8. See description for bit 0." begin="8" end="8" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF9" description="Cancellation Finished 9. See description for bit 0." begin="9" end="9" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF10" description="Cancellation Finished 10. See description for bit 0." begin="10" end="10" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF11" description="Cancellation Finished 11. See description for bit 0." begin="11" end="11" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF12" description="Cancellation Finished 12. See description for bit 0." begin="12" end="12" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF13" description="Cancellation Finished 13. See description for bit 0." begin="13" end="13" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF14" description="Cancellation Finished 14. See description for bit 0." begin="14" end="14" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF15" description="Cancellation Finished 15. See description for bit 0." begin="15" end="15" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF16" description="Cancellation Finished 16. See description for bit 0." begin="16" end="16" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF17" description="Cancellation Finished 17. See description for bit 0." begin="17" end="17" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF18" description="Cancellation Finished 18. See description for bit 0." begin="18" end="18" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF19" description="Cancellation Finished 19. See description for bit 0." begin="19" end="19" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF20" description="Cancellation Finished 20. See description for bit 0." begin="20" end="20" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF21" description="Cancellation Finished 21. See description for bit 0." begin="21" end="21" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF22" description="Cancellation Finished 22. See description for bit 0." begin="22" end="22" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF23" description="Cancellation Finished 23. See description for bit 0." begin="23" end="23" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF24" description="Cancellation Finished 24. See description for bit 0." begin="24" end="24" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF25" description="Cancellation Finished 25. See description for bit 0." begin="25" end="25" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF26" description="Cancellation Finished 26. See description for bit 0." begin="26" end="26" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF27" description="Cancellation Finished 27. See description for bit 0." begin="27" end="27" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF28" description="Cancellation Finished 28. See description for bit 0." begin="28" end="28" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF29" description="Cancellation Finished 29. See description for bit 0." begin="29" end="29" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF30" description="Cancellation Finished 30. See description for bit 0." begin="30" end="30" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CF31" description="Cancellation Finished 31. See description for bit 0." begin="31" end="31" width="1" rwaccess="R">
            </bitfield>
        </register>
