ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/CANFD1_1.0.xml
                <register id="CANFD1_MCANSS_EOI" width="32" offset="0x20" description="MCAN Subsystem End of Interrupt">
                    <bitfield id="EOI" description="End of Interrupt. A write to this register will clear the associated interrupt. If the unserviced interrupt counter is &gt; 1, another interrupt is generated.
  0x00  External TS Interrupt is cleared
  0x01  MCAN(0) interrupt is cleared
  0x02  MCAN(1) interrupt is cleared
  Other writes are ignored." begin="7" end="0" width="8" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANSS_EXT_TS_PRESCALER" width="32" offset="0x24" description="MCAN Subsystem External Timestamp Prescaler 0">
                    <bitfield id="PRESCALER" description="External Timestamp Prescaler Reload Value. The external timestamp count rate is the host (system) clock rate divided by this value, except in the case of 0. A zero value in this bit field will act identically to a value of 0x000001." begin="23" end="0" width="24" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR" width="32" offset="0x28" description="MCAN Subsystem External Timestamp Unserviced Interrupts Counter">
                    <bitfield id="EXT_TS_INTR_CNTR" description="External Timestamp Counter Unserviced Rollover Interrupts. If this value is &gt; 1, an MCANSS_EOI write of '1' to bit 0 will issue another interrupt.
 
The status of this bit field is affected by the MCANSS_IRS.EXT_TS_CNTR_OVFL bit field." begin="4" end="0" width="5" rwaccess="R">
                    </bitfield>
                </register>
                </group>
            <group id="CANFD1_MCAN_ECC_REGS" name="CANFD1_MCAN_ECC_REGS" instances="1" offset="0x200" instaddr="0x210" description="">
                <register id="CANFD1_MCANERR_REV" width="32" offset="0x0" description="MCAN Error Aggregator Revision Register">
                    <bitfield id="REVMIN" description="Minor Revision of the Error Aggregator" begin="5" end="0" width="6" rwaccess="R">
                    </bitfield>
                    <bitfield id="REVMAJ" description="Major Revision of the Error Aggregator" begin="10" end="8" width="3" rwaccess="R">
                    </bitfield>
                    <bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R">
                    </bitfield>
                    <bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_VECTOR" width="32" offset="0x8" description="MCAN ECC Vector Register">
                    <bitfield id="ECC_VECTOR" description="ECC RAM ID. Each error detection and correction (EDC) controller has a bank of error registers (offsets 0x10 - 0x3B) associated with it. These registers are accessed via an internal serial bus (SVBUS). To access them through the ECC aggregator the controller ID desired must be written to the ECC_VECTOR field, together with the RD_SVBUS trigger and RD_SVBUS_ADDRESS bit field. This initiates the serial read which consummates by setting the RD_SVBUS_DONE bit. At this point the addressed register may be read by a normal CPU read of the appropriate offset address.
  0x000  Message RAM ECC controller is selected
  Others  Reserved (do not use)
 
Subsequent writes through the SVBUS (offsets 0x10 - 0x3B) have a delayed completion. To avoid conflicts, perform a read back of a register within this range after writing." begin="10" end="0" width="11" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="RD_SVBUS" description="Read Trigger" begin="15" end="15" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="RD_SVBUS_ADDRESS" description="Read Address Offset" begin="23" end="16" width="8" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="RD_SVBUS_DONE" description="Read Completion Flag" begin="24" end="24" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_STAT" width="32" offset="0xC" description="MCAN Error Misc Status">
                    <bitfield id="NUM_RAMS" description="Number of RAMs. Number of ECC RAMs serviced by the aggregator." begin="10" end="0" width="11" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_WRAP_REV" width="32" offset="0x10" description="MCAN ECC Wrapper Revision Register">
                    <bitfield id="REVMIN" description="Minor Revision of the Error Aggregator" begin="5" end="0" width="6" rwaccess="R">
                    </bitfield>
                    <bitfield id="REVMAJ" description="Major Revision of the Error Aggregator" begin="10" end="8" width="3" rwaccess="R">
                    </bitfield>
                    <bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R">
                    </bitfield>
                    <bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_CTRL" width="32" offset="0x14" description="MCAN ECC Control">
                    <bitfield id="ECC_ENABLE" description="Enable ECC Generation" begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_CHECK" description="Enable ECC Check. ECC is completely bypassed if both ECC_ENABLE and ECC_CHECK are '0'." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ENABLE_RMW" description="Enable read-modify-write on partial word writes" begin="2" end="2" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="FORCE_SEC" description="Force single-bit error. Cleared on a writeback or the cycle following the error if ERROR_ONCE is asserted. For write through mode, this applies to writes as well as reads. MCANERR_ERR_CTRL1 and MCANERR_ERR_CTRL2 should be configured prior to setting this bit." begin="3" end="3" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="FORCE_DED" description="Force double-bit error. Cleared the cycle following the error if ERROR_ONCE is asserted. For write through mode, this applies to writes as well as reads. MCANERR_ERR_CTRL1 and MCANERR_ERR_CTRL2 should be configured prior to setting this bit." begin="4" end="4" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="FORCE_N_ROW" description="Enable single/double-bit error on the next RAM read, regardless of the MCANERR_ERR_CTRL1.ECC_ROW setting. For write through mode, this applies to writes as well as reads." begin="5" end="5" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ERROR_ONCE" description="If this bit is set, the FORCE_SEC/FORCE_DED will inject an error to the specified row only once. The FORCE_SEC bit will be cleared once a writeback happens. If writeback is not enabled, this error will be cleared the cycle following the read when the data is corrected. For double-bit errors, the FORCE_DED bit will be cleared the cycle following the double-bit error. Any subsequent reads will not force an error." begin="6" end="6" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CHECK_SVBUS_TIMEOUT" description="Enables Serial VBUS timeout mechanism" begin="8" end="8" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_ERR_CTRL1" width="32" offset="0x18" description="MCAN ECC Error Control 1 Register">
                </register>
