ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/CANFD1_1.0.xml
                <register id="CANFD1_MCANERR_ERR_CTRL2" width="32" offset="0x1C" description="MCAN ECC Error Control 2 Register">
                    <bitfield id="ECC_BIT1" description="Column/Data bit that needs to be flipped when FORCE_SEC or FORCE_DED is set" begin="15" end="0" width="16" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_BIT2" description="Second column/data bit that needs to be flipped when FORCE_DED is set" begin="31" end="16" width="16" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_ERR_STAT1" width="32" offset="0x20" description="MCAN ECC Error Status 1 Register">
                    <bitfield id="ECC_SEC" description="Single Bit Error Corrected Status. A 2-bit saturating counter of the number of SEC errors that have occurred since last cleared.
 
  0  No single-bit error detected
  1  One single-bit error was detected and corrected
  2  Two single-bit errors were detected and corrected
  3  Three single-bit errors were detected and corrected
 
A write of a non-zero value to this bit field increments it by the value provided." begin="1" end="0" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_DED" description="Double Bit Error Detected Status. A 2-bit saturating counter of the number of DED errors that have occurred since last cleared.
 
  0  No double-bit error detected
  1  One double-bit error was detected
  2  Two double-bit errors were detected
  3  Three double-bit errors were detected
 
A write of a non-zero value to this bit field increments it by the value provided." begin="3" end="2" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_OTHER" description="SEC While Writeback Error Status
  0  No SEC error while writeback pending
  1  Indicates that successive single-bit errors have occurred while a writeback is still pending" begin="4" end="4" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CTRL_REG_ERROR" description="Control Register Error. A bit field in the control register is in an ambiguous state. This means that the redundancy registers have detected a state where not all values are the same and has defaulted to the reset state. S/W needs to re-write these registers to a known state. A write of 1 will set this interrupt flag." begin="7" end="7" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_ECC_SEC" description="Clear ECC_SEC. A write of a non-zero value to this bit field decrements the ECC_SEC bit field by the value provided." begin="9" end="8" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_ECC_DED" description="Clear ECC_DED. A write of a non-zero value to this bit field decrements the ECC_DED bit field by the value provided." begin="11" end="10" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_ECC_OTHER" description="Writing a '1' clears the ECC_OTHER bit." begin="12" end="12" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_CTRL_REG_ERROR" description="Writing a '1' clears the CTRL_REG_ERROR bit" begin="15" end="15" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_BIT1" description="ECC Error Bit Position. Indicates the bit position in the RAM data that is in error on an SEC error. Only valid on an SEC error.
  0  Bit 0 is in error
  1  Bit 1 is in error
  2  Bit 2 is in error
  3  Bit 3 is in error
  ...
  31 Bit 31 is in error
  &gt;32 Invalid" begin="31" end="16" width="16" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_ERR_STAT2" width="32" offset="0x24" description="MCAN ECC Error Status 2 Register">
                </register>
                <register id="CANFD1_MCANERR_ERR_STAT3" width="32" offset="0x28" description="MCAN ECC Error Status 3 Register">
                    <bitfield id="WB_PEND" description="Delayed Write Back Pending Status
  0  No write back pending
  1  An ECC data correction write back is pending" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                    <bitfield id="SVBUS_TIMEOUT" description="Serial VBUS Timeout Flag. Write 1 to set." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_SVBUS_TIMEOUT" description="Write 1 to clear the Serial VBUS Timeout Flag" begin="9" end="9" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_SEC_EOI" width="32" offset="0x3C" description="MCAN Single Error Corrected End of Interrupt Register">
                    <bitfield id="EOI_WR" description="Write to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host.
 
Note that a write to the  MCANERR_ERR_STAT1.CLR_ECC_SEC goes through the SVBUS and has a delayed completion. To avoid an additional interrupt, read the MCANERR_ERR_STAT1 register back prior to writing to this bit field." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_SEC_STATUS" width="32" offset="0x40" description="MCAN Single Error Corrected Interrupt Status Register">
                    <bitfield id="MSGMEM_PEND" description="Message RAM SEC Interrupt Pending
  0  No SEC interrupt is pending
  1  SEC interrupt is pending" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_SEC_ENABLE_SET" width="32" offset="0x80" description="MCAN Single Error Corrected Interrupt Enable Set Register">
                    <bitfield id="MSGMEM_ENABLE_SET" description="Message RAM SEC Interrupt Pending Enable Set. Writing a 1 to this bit enables the Message RAM SEC error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_SEC_ENABLE_CLR" width="32" offset="0xC0" description="MCAN Single Error Corrected Interrupt Enable Clear Register">
                    <bitfield id="MSGMEM_ENABLE_CLR" description="Message RAM SEC Interrupt Pending Enable Clear. Writing a 1 to this bit disables the Message RAM SEC error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_DED_EOI" width="32" offset="0x13C" description="MCAN Double Error Detected End of Interrupt Register">
                    <bitfield id="EOI_WR" description="Write to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host.
 
Note that a write to the  MCANERR_ERR_STAT1.CLR_ECC_DED goes through the SVBUS and has a delayed completion. To avoid an additional interrupt, read the MCANERR_ERR_STAT1 register back prior to writing to this bit field." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_DED_STATUS" width="32" offset="0x140" description="MCAN Double Error Detected Interrupt Status Register">
                    <bitfield id="MSGMEM_PEND" description="Message RAM DED Interrupt Pending
  0  No DED interrupt is pending
  1  DED interrupt is pending" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_DED_ENABLE_SET" width="32" offset="0x180" description="MCAN Double Error Detected Interrupt Enable Set Register">
                    <bitfield id="MSGMEM_ENABLE_SET" description="Message RAM DED Interrupt Pending Enable Set. Writing a 1 to this bit enables the Message RAM DED error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_DED_ENABLE_CLR" width="32" offset="0x1C0" description="MCAN Double Error Detected Interrupt Enable Clear Register">
                    <bitfield id="MSGMEM_ENABLE_CLR" description="Message RAM DED Interrupt Pending Enable Clear. Writing a 1 to this bit disables the Message RAM DED error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_AGGR_ENABLE_SET" width="32" offset="0x200" description="MCAN Error Aggregator Enable Set Register">
                    <bitfield id="ENABLE_PARITY_SET" description="Write 1 to enable parity errors. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ENABLE_TIMEOUT_SET" description="Write 1 to enable timeout errors. Reads return the corresponding enable bit's current value." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_AGGR_ENABLE_CLR" width="32" offset="0x204" description="MCAN Error Aggregator Enable Clear Register">
                    <bitfield id="ENABLE_PARITY_CLR" description="Write 1 to disable parity errors. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ENABLE_TIMEOUT_CLR" description="Write 1 to disable timeout errors. Reads return the corresponding enable bit's current value." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD1_MCANERR_AGGR_STATUS_SET" width="32" offset="0x208" description="MCAN Error Aggregator Status Set Register">
                    <bitfield id="AGGR_PARITY_ERR" description="Aggregator Parity Error Status
 
2-bit saturating counter of the number of parity errors that have occurred since last cleared.
  0  No parity errors have occurred
  1  One parity error has occurred
  2  Two parity errors have occurred
  3  Three parity errors have occurred
 
A write of a non-zero value to this bit field increments it by the value provided." begin="1" end="0" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="SVBUS_TIMEOUT" description="Aggregator Serial VBUS Timeout Error Status
 
2-bit saturating counter of the number of SVBUS timeout errors that have occurred since last cleared.
  0  No timeout errors have occurred
  1  One timeout error has occurred
  2  Two timeout errors have occurred
  3  Three timeout errors have occurred
 
A write of a non-zero value to this bit field increments it by the value provided." begin="3" end="2" width="2" rwaccess="R/W">
                    </bitfield>
                </register>
