ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/CANFD1_1.0.xml
                <register id="CANFD1_MCANERR_AGGR_STATUS_CLR" width="32" offset="0x20C" description="MCAN Error Aggregator Status Clear Register">
                    <bitfield id="AGGR_PARITY_ERR" description="Aggregator Parity Error Status
 
2-bit saturating counter of the number of parity errors that have occurred since last cleared.
  0  No parity errors have occurred
  1  One parity error has occurred
  2  Two parity errors have occurred
  3  Three parity errors have occurred
 
A write of a non-zero value to this bit field decrements it by the value provided." begin="1" end="0" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="SVBUS_TIMEOUT" description="Aggregator Serial VBUS Timeout Error Status
 
2-bit saturating counter of the number of SVBUS timeout errors that have occurred since last cleared.
  0  No timeout errors have occurred
  1  One timeout error has occurred
  2  Two timeout errors have occurred
  3  Three timeout errors have occurred
 
A write of a non-zero value to this bit field decrements it by the value provided." begin="3" end="2" width="2" rwaccess="R/W">
                    </bitfield>
                </register>
                </group>
            </group>
        <group id="CANFD1_MSP" name="CANFD1_MSP" instances="1" offset="0x600" instaddr="0x400" description="">
            <group id="CANFD1_CPU_INT" name="CANFD1_CPU_INT" instances="1" offset="0x20" instaddr="0x30" description="">
                <register id="CANFD1_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
                    <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                        <bitenum id="NO_INTR" value="0x0" description="No interrupt pending."/>
                        <bitenum id="INTL0" value="0x1" description="MCAN Interrupt Line 0 interrupt pending."/>
                        <bitenum id="INTL1" value="0x2" description="MCAN Interrupt Line 1 interrupt pending."/>
                        <bitenum id="SEC" value="0x3" description="Message RAM SEC (Single Error Correction) interrupt pending."/>
                        <bitenum id="DED" value="0x4" description="Message RAM DED (Double Error Detection)  interrupt pending."/>
                        <bitenum id="EXT_TS_CNTR_OVFL" value="0x5" description="External Timestamp Counter Overflow interrupt pending."/>
                        <bitenum id="WAKEUP" value="0x6" description="Clock Stop Wake Up interrupt pending."/>
                    </bitfield>
                </register>
                <register id="CANFD1_IMASK" width="32" offset="0x8" description="Interrupt mask">
                    <bitfield id="INTL0" description="MCAN Interrupt Line 0 mask." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="INTL1" description="MCAN Interrupt Line 1 mask." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="SEC" description="Message RAM SEC interrupt mask." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="DED" description="Massage RAM DED interrupt mask." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow interrupt mask." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Clock Stop Wake Up interrupt mask." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                </register>
                <register id="CANFD1_RIS" width="32" offset="0x10" description="Raw interrupt status">
                    <bitfield id="INTL0" description="MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="INTL1" description="MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="SEC" description="Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="DED" description="Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                </register>
